{
  "passages": [
    {
      "text": "Sunlight warms your face as it flows through the cave, spreading out more and more as daybreak progresses. You slowly, groggily open your eyes with a big yawn. Hoisting yourself onto your feet, you stretch: from a slow roll of your head and bending forward with your front two feet, to flexing and shaking out your wings and extending your back two legs behind. Satisfied, you climb down off of your mountain of treasures to find some breakfast. \n\nOut of the corner of your eye, you see a smaller shadow begin to crawl up next to yours on the wall in front of you.\n\n\n[[A:  Ignore it, my eyes may be playing tricks on me, or maybe a bird landed out front. No cause for concern.]]\n\n[[B:  No harm in checking it out, I suppose. I'm sure it's probably nothing, but on the off chance I might have a visitor? Of course I'm going to go see.]]\n\n[[C:  I whirl around instantly, baring my teeth, and scour the cave for signs of any intruders. Smoke flows from my nostrils in quick puffs as my belly grows hot with flame.]]",
      "links": [
        {
          "name": "Ignore it, my eyes may be playing tricks on me, or maybe a bird landed out front. No cause for concern. ",
          "letter": "a",
          "link": " Breakfast",
          "pid": "2"
        },
        {
          "name": "No harm in checking it out, I suppose. I'm sure it's probably nothing, but on the off chance I might have a visitor? Of course I'm going to go see. ",
          "letter": "b",
          "link": " Investigating",
          "pid": "3"
        },
        {
          "name": "I whirl around instantly, baring my teeth, and scour the cave for signs of any intruders. Smoke flows from my nostrils in quick puffs as my belly grows hot with flame. ",
          "letter": "c",
          "link": " Defensive",
          "pid": "4"
        }
      ],
      "name": "Den",
      "pid": "1",
      "position": {
        "x": "866",
        "y": "322.66666666666663"
      }
    },
    {
      "text": "Deciding there was nothing to worry about, you continue going about your business. You rummage around the back of the den, searching for any remaining bundles of berries in your stash, knowing that if you were out, you'd have to go out and hunt, and it was WAY too early for that. You frowned as the situation began to look bleak.\n\nLeaning over the last tattered wooden box, you hear the snap of a bowstring, and suddenly a sharp pain blossoms between your folded wings. Another arrow swiftly follows as you try to register what happened. You whirl around, this time taking an arrow to the chest, and you find a human fighter armed with a crossbow standing at the mouth of the cave.\n\n(You've taken 6 points of damage from the arrows.)\n\n\n[[A:  I let out a powerful roar and then roast the fighter where they stand with a column of white-hot flame.]]\n\n[[B:  I call out to the fighter, telling them I don't want to hurt them.]]\n\n[[C:  I bare my teeth as a low growl begins in my chest. Seeing the fighter merely adjust their stance and prepare to loose another arrow, I charge at them, hoping they will simply flee.]]",
      "damage": 6,
      "links": [
        {
          "name": "I let out a powerful roar and then roast the fighter where they stand with a column of white-hot flame. ",
          "letter": "a",
          "link": " Killed Fighter",
          "pid": "5"
        },
        {
          "name": "I call out to the fighter, telling them I don't want to hurt them. ",
          "letter": "b",
          "link": " Talking",
          "pid": "8"
        },
        {
          "name": "I bare my teeth as a low growl begins in my chest. Seeing the fighter merely adjust their stance and prepare to loose another arrow, I charge at them, hoping they will simply flee. ",
          "letter": "c",
          "link": " Charge",
          "pid": "6"
        }
      ],
      "name": " Breakfast",
      "pid": "2",
      "position": {
        "x": "553.6666666666667",
        "y": "436.99999999999994"
      }
    },
    {
      "text": "\"Who's there?\" you call out, and begin to slowly turn around, so as to not seem threatening. While part of you longed for some company, you quietly hoped that no old friends had decided to pay you a visit today. The den was a mess, there was at least an 80% chance that there wasn't a crumb of food left in the place, that pile of bones from dinner that weekend-\n\"Wha-? Uh, freeze!\"\nAt the mouth of your cave was a human fighter. They were armed with a crossbow, already drawn and locked and aimed at your chest, but they had apparently been caught off guard by something.\n\"Hey, whoah! I don't want a fight!\" You take a step back to emphasize your point.\nThe fighter lowered their weapon slightly, a puzzled look on their face.\n\"You... you don't?... I don't-\"\n\"Hey, what's going on in there?!\" hissed a voice behind the fighter. Must be a whole party out there on the slope. Great.\n\n\n[[A:  Knowing that, backed into a cave as I am, I am not in the position to fight all of them at once, I decide to flee. Let 'em raid my hoard, it's all just stuff anyway. I don't want to kill anyone. I unfurl my wings and leap into the air, flying past the fighter and soaring away under the open sky.]]\n\n[[B:  There's more of them. They came to kill me, as they have so many more of my kind. Unprovoked, they must come for combat experience, loot, glory; any number of selfish causes that masquerade as worthy in their society. Their mistake. Only their souls will be leaving this battle. I growl as I can feel the anger bubbling inside me, boiling into flames.]] \n\n[[C:  \"Why are you here?\" I ask calmly, despite the slight tingle of worry buzzing in the back of my mind. I should be more scared, considering I had a crossbow looking to take me out, but this fighter seems to be less interested in attacking now. I want to give them a chance. \"Can I help you with something?\"]] ",
      "links": [
        {
          "name": "Knowing that, backed into a cave as I am, I am not in the position to fight all of them at once, I decide to flee. Let 'em raid my hoard, it's all just stuff anyway. I don't want to kill anyone. I unfurl my wings and leap into the air, flying past the fighter and soaring away under the open sky. ",
          "letter": "a",
          "link": " Flee",
          "pid": "7"
        },
        {
          "name": "There's more of them. They came to kill me, as they have so many more of my kind. Unprovoked, they must come for combat experience, loot, glory; any number of selfish causes that masquerade as worthy in their society. Their mistake. Only their souls will be leaving this battle. I growl as I can feel the anger bubbling inside me, boiling into flames. ",
          "letter": "b",
          "link": " Killed Fighter",
          "pid": "5"
        },
        {
          "name": "\"Why are you here?\" I ask calmly, despite the slight tingle of worry buzzing in the back of my mind. I should be more scared, considering I had a crossbow looking to take me out, but this fighter seems to be less interested in attacking now. I want to give them a chance. \"Can I help you with something?\" ",
          "letter": "c",
          "link": " Talking",
          "pid": "8"
        }
      ],
      "name": " Investigating",
      "pid": "3",
      "position": {
        "x": "1156.6666666666665",
        "y": "368.6666666666667"
      }
    },
    {
      "text": "Your eyes light upon a human fighter standing at the mouth of the cave, pointing a loaded crossbow at your chest. Their eyes have gone wide, and before you can make a move, their trigger finger twitches and an arrow strikes you in the chest.\nWell, at least you spooked 'em.\nHowever, nervous as they are, the fighter stands their ground as they load another arrow. Inexperienced, maybe, but brave- undoubtedly.\n\n(You've taken 2 points of damage from the arrow.)\n\n\n[[A:  They seem intent on fighting. I don't know if I have any other choice but to take them out. Besides, they brought this on themselves, and humans have never done aything to earn the trust of my kind. My growl becomes a roar and I release the fire inside my chest.]]\n\n[[B:  If just seeing me scared them a bit, maybe I can chase them away. I bare my teeth, bow my head until my pointed horns mark my target, and charge with as vicious a roar as I can muster.]]\n\n[[C:  They seem like they mean business, but I don't think they know what they're getting into. I don't want to kill anyone, but I also don't want to just let them hurt me. Whatever, let them raid my hoard, as long as no one gets hurt. It's all just stuff in the end. I unfurl my wings, and with a powerful leap, I'm soaring out of the cave, looking down upon the fighter.]]",
      "damage": 2,
      "links": [
        {
          "name": "They seem intent on fighting. I don't know if I have any other choice but to take them out. Besides, they brought this on themselves, and humans have never done aything to earn the trust of my kind. My growl becomes a roar and I release the fire inside my chest. ",
          "letter": "a",
          "link": " Killed Fighter",
          "pid": "5"
        },
        {
          "name": "If just seeing me scared them a bit, maybe I can chase them away. I bare my teeth, bow my head until my pointed horns mark my target, and charge with as vicious a roar as I can muster. ",
          "letter": "b",
          "link": " Charge",
          "pid": "6"
        },
        {
          "name": "They seem like they mean business, but I don't think they know what they're getting into. I don't want to kill anyone, but I also don't want to just let them hurt me. Whatever, let them raid my hoard, as long as no one gets hurt. It's all just stuff in the end. I unfurl my wings, and with a powerful leap, I'm soaring out of the cave, looking down upon the fighter. ",
          "letter": "c",
          "link": " Flee",
          "pid": "7"
        }
      ],
      "name": " Defensive",
      "pid": "4",
      "position": {
        "x": "827.3333333333333",
        "y": "530.6666666666666"
      }
    },
    {
      "text": "They have no time to scream before their ashen remains crumble to the cave floor. The pile of coal-black dust is quickly scattered in the soft morning breeze. \"Who's next?\" you snarl, marching to the front of the den. \n\nOutside on the slope you find the rest of the party scattered about, now merely four strong: a human warlock, a dwarf paladin, a druid ranger, and an elf rogue. Some are in shock, others are clearly brimming with fury. \n\nThe human warlock suddenly leaps forth, out of their bush, catching the others off guard. He conjures a longsword that glows purple with ethereal power, and charges at you with an unholy scream of agony.\n\nYou realize you have only two choices now.\n\n[[A:  Take them out]]\n[[B:  Flee]]",
      "links": [
        {
          "name": "Take them out ",
          "letter": "a",
          "link": " Kill them all (almost)",
          "pid": "11"
        },
        {
          "name": "Flee ",
          "letter": "b",
          "link": " Flee",
          "pid": "7"
        }
      ],
      "name": " Killed Fighter",
      "pid": "5",
      "position": {
        "x": "838",
        "y": "727.6666666666667"
      }
    },
    {
      "text": "The fighter's brown eyes light up with terror. They sloppily loose the bolt already loaded and begin to fumble for their sword. The arrow merely grazes your side. You take 1 point of damage.\n\nNow worringly close (for the both of you), you steel yourself and continue the charge. The fighter looks up from the sheath at their side, which seemed to be tangled up with their satchel and quiver straps, and, meeting your ruby eyes, turns and runs down the slope as fast as they can, stumbling once along the way.\n\n\"Run, guys! Go!\" they yell.\n\n\"Wha-? But what about the head? We agreed to this quest!\" a dwarven paladin exclaimed, his deep, husky voice carrying clear signs of irritation.\n\n\"Just forget it! We'll come up with a plan B once we can regroup!\" The fighter shoves a confused druid further into the thicket ahead, and then drags an elf along behind them. Another human follows, and the dwarf brings up the rear, after making sure the rest of the party gets out.\n\nYou slide to a stop, breathing heavily. You realize you're out of shape on foot. As you stand in shame to catch your breath, a glint of light in the grass catches your eye. Upon closer inspection, you find that the source is a silver pendant on a chain. Wait, no, not a pendant- you notice a latch on the side. \n\n\n[[A:  The fighter must have dropped this when they tripped. I should go after them to return it before their trail goes cold!]]\n\n[[B:  This must belong to the fighter. Either that, or they looted it off of some poor passerby. I should take a look at it, and then make a plan for returning it.]]",
      "damage": 1,
      "links": [
        {
          "name": "The fighter must have dropped this when they tripped. I should go after them to return it before their trail goes cold! ",
          "letter": "a",
          "link": " Follow",
          "pid": "9"
        },
        {
          "name": "This must belong to the fighter. Either that, or they looted it off of some poor passerby. I should take a look at it, and then make a plan for returning it. ",
          "letter": "b",
          "link": " Stay",
          "pid": "10"
        }
      ],
      "name": " Charge",
      "pid": "6",
      "position": {
        "x": "487",
        "y": "628"
      }
    },
    {
      "text": "The morning breeze feels like pure bliss. Nothing better than a sunrise flight...\n\nYou take a glance behind and see that a group has formed in front of your den, seemingly discussing their next move. It's strange that they don't seem to be interested in looting, considering the fact that they attacked a dragon's den.. But you're not one to look a gift horse in the mouth, so you just go back to enjoying the open sky.\n\n\n[[A:  Hey, why not land and see if I can find some food? I've got time to kill anyway.]]\n[[B:  I think I'll fly around a little longer and then head back home, make sure everything's alright.]]",
      "links": [
        {
          "name": "Hey, why not land and see if I can find some food? I've got time to kill anyway. ",
          "letter": "a",
          "link": " Event A",
          "pid": "16"
        },
        {
          "name": "I think I'll fly around a little longer and then head back home, make sure everything's alright. ",
          "letter": "b",
          "link": " Return Home",
          "pid": "14"
        }
      ],
      "name": " Flee",
      "pid": "7",
      "position": {
        "x": "1085.6666666666663",
        "y": "533.6666666666666"
      }
    },
    {
      "text": "\"You- you //don't// want to make me your breakfast?..\"\n\n\"No, not really,\" you say casually. \"But I //would// like to get back to finding my actual breakfast. Are you looking for something, or are you here to \"slay\" me?\" You decide to get straight to the point, keeping your distance and trying to maintain as relaxed a posture as possible.\n\nThe fighter shifted their weight awkwardly, the bow seeming to be growing heavy in their hands. With a shake of their head, they returned the crossbow to its original position and hardened their face. \"We need your head to save my brother. And- and I'm not going to be leaving without it,\"\n\nWell, that's not good.\n\n[[A:  There has to be some other way... Come on, think...]]\n\n[[B:  I guess it's kill or be killed. Besides, my kind would be much better off with one less human around.]]",
      "links": [
        {
          "name": "There has to be some other way... Come on, think... ",
          "letter": "a",
          "link": " Offer Help",
          "pid": "20"
        },
        {
          "name": "I guess it's kill or be killed. Besides, my kind would be much better off with one less human around. ",
          "letter": "b",
          "link": " Killed Fighter",
          "pid": "5"
        }
      ],
      "name": " Talking",
      "pid": "8",
      "position": {
        "x": "1437",
        "y": "589.6666666666665"
      }
    },
    {
      "text": "[[Text 1 -> Event B]]",
      "links": [
        {
          "name": "Text 1 ",
          "link": " Event B",
          "pid": "15"
        }
      ],
      "name": " Follow",
      "pid": "9",
      "position": {
        "x": "406.6666666666667",
        "y": "812"
      }
    },
    {
      "text": "WIP\n\n[[Text 1 -> Path 1]]\n[[Text 2 -> Path 2]] ",
      "links": [
        {
          "name": "Text 1 ",
          "link": " Path 1",
          "pid": "21"
        },
        {
          "name": "Text 2 ",
          "link": " Path 2",
          "pid": "22"
        }
      ],
      "name": " Stay",
      "pid": "10",
      "position": {
        "x": "643.3333333333334",
        "y": "819.3333333333334"
      }
    },
    {
      "text": "one escapes and presumably warns village\n[[Text 1 -> Attack first]]\n[[Text 2 -> Let them make the first move]]",
      "links": [
        {
          "name": "Text 1 ",
          "link": " Attack first",
          "pid": "12"
        },
        {
          "name": "Text 2 ",
          "link": " Let them make the first move",
          "pid": "13"
        }
      ],
      "name": " Kill them all (almost)",
      "pid": "11",
      "position": {
        "x": "859.6666666666666",
        "y": "1044"
      }
    },
    {
      "text": "WIP\n\n\n[[Text 1 -> Route 1]]\n\n[[Text 2 -> Route 2]]",
      "links": [
        {
          "name": "Text 1 ",
          "link": " Route 1",
          "pid": "23"
        },
        {
          "name": "Text 2 ",
          "link": " Route 2",
          "pid": "24"
        }
      ],
      "name": " Attack first",
      "pid": "12",
      "position": {
        "x": "1030.6666666666667",
        "y": "1190"
      }
    },
    {
      "text": "WIP\n\n[[Text 1 -> Prep]]\n\n[[Text 2 -> No Prep]]",
      "links": [
        {
          "name": "Text 1 ",
          "link": " Prep",
          "pid": "25"
        },
        {
          "name": "Text 2 ",
          "link": " No Prep",
          "pid": "26"
        }
      ],
      "name": " Let them make the first move",
      "pid": "13",
      "position": {
        "x": "735.3333333333334",
        "y": "1195.3333333333335"
      }
    },
    {
      "text": "\"Oh! One of these, what do they call them... starts with an L.... Llllongggg... no... Lllockkkk- Lockets! Yeah, that's the one! Some human jewelry thing. And I believe-\" you fumble with the tiny clasp, cursing your reptilian claws, until it pops open with a small click, \"-they keep things inside.\"\n\nSure enough, within the locket you find two faded miniature paintings, one on either side. One was of a man and a woman huddled close, both wearing warm, sincere smiles. The other depicted a trio of young children, two sitting on the ground in the front, expressions somewhere between annoyed and almost cracking up, and the third sort of draped over the shoulders of their siblings, holding tight to a handmade stuffed dog and grinning with glee.\n\n[[Text 1 -> Event C]]",
      "links": [
        {
          "name": "Text 1 ",
          "link": " Event C",
          "pid": "28"
        }
      ],
      "name": " Return Home",
      "pid": "14",
      "position": {
        "x": "1265.6666666666667",
        "y": "723"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": " Event B",
      "pid": "15",
      "position": {
        "x": "378.33333333333337",
        "y": "967"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": " Event A",
      "pid": "16",
      "position": {
        "x": "1028.9999999999998",
        "y": "750.3333333333334"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "Bad Ending",
      "pid": "17",
      "position": {
        "x": "287.9999999999999",
        "y": "2212.666666666667"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "Good Ending",
      "pid": "18",
      "position": {
        "x": "1451.6666666666665",
        "y": "2201"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "Neutral Ending",
      "pid": "19",
      "position": {
        "x": "891.6666666666666",
        "y": "2204.666666666667"
      }
    },
    {
      "text": "WIP\nsend them on their way, examine dropped locket, set off to return it\nsomething needs to happen here, or some item needs to be obtained here, that will count towards good ending progress\n\n\n\n[[Text 1 -> Path 1]]\n[[Text 2 -> Path 2]]",
      "links": [
        {
          "name": "Text 1 ",
          "link": " Path 1",
          "pid": "21"
        },
        {
          "name": "Text 2 ",
          "link": " Path 2",
          "pid": "22"
        }
      ],
      "name": " Offer Help",
      "pid": "20",
      "position": {
        "x": "1460.3333333333333",
        "y": "744.6666666666667"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": " Path 1",
      "pid": "21",
      "position": {
        "x": "1437",
        "y": "1008.0000000000002"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": " Path 2",
      "pid": "22",
      "position": {
        "x": "1633.6666666666665",
        "y": "1014.6666666666666"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": " Route 1",
      "pid": "23",
      "position": {
        "x": "962.3333333333334",
        "y": "1375"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": " Route 2",
      "pid": "24",
      "position": {
        "x": "1164",
        "y": "1378.3333333333335"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": " Prep",
      "pid": "25",
      "position": {
        "x": "613.6666666666667",
        "y": "1378.6666666666667"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": " No Prep",
      "pid": "26",
      "position": {
        "x": "807",
        "y": "1377"
      }
    },
    {
      "text": "WIP\n\n\n[[Choice one, only if on good ending ->Good Ending]] \n[[Choice two, only if on neutral path ->Neutral Ending]] \n[[Choice three, only if on bad path ->Bad Ending]] ",
      "links": [
        {
          "name": "Choice one, only if on good ending ",
          "link": "Good Ending",
          "pid": "18"
        },
        {
          "name": "Choice two, only if on neutral path ",
          "link": "Neutral Ending",
          "pid": "19"
        },
        {
          "name": "Choice three, only if on bad path ",
          "link": "Bad Ending",
          "pid": "17"
        }
      ],
      "name": "Reaching the Town",
      "pid": "27",
      "position": {
        "x": "902.3333333333334",
        "y": "1916.666666666667"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": " Event C",
      "pid": "28",
      "position": {
        "x": "1152.3333333333335",
        "y": "953"
      }
    }
  ],
  "name": "Dragon RPG",
  "startnode": "1",
  "creator": "Twine",
  "creator-version": "2.3.11",
  "ifid": "404502A1-F4DD-4A0D-8BB3-634CA707596D"
}